#include <stdio.h>
/* 计算个人所得税 */
int main(){
float sr,se,d1,d2,d3,d4,d5,d6,d7,d8,d9;
d1=500*0.05;
d2=d1+1500*0.1;
d3=d2+3000*0.15;
d4=d3+15000*0.20;
d5=d4+20000*0.25;
d6=d5+20000*0.30;
d7=d6+20000*0.35;
d8=d7+20000*0.40;

scanf("%f",&sr);
sr-=1600; /* 超过1600部分，即应纳税部分 */
if(sr<=0) /* 没有超过1600，不纳税 */
se=0; 
else if(sr<500) /* 超过部分<500 */
se=0.05*sr;
else if(sr<2000) /* 超过部分500~2000 */
se=d1+0.1*(sr-500);
else if(sr<5000) /* 超过部分2000~5000 */
se=d2+0.15*(sr-2000);
else if(sr<20000) /* 超过部分5000~20000 */
se=d3+0.20*(sr-5000);
else if(sr<40000) /* 超过部分20000~40000 */
se=d4+0.25*(sr-20000);
else if(sr<60000) /* 超过部分40000~60000 */
se=d5+0.30*(sr-40000);
else if(sr<80000) /* 超过部分60000~80000 */
se=d6+0.35*(sr-60000);
else if(sr<100000) /* 超过部分80000~100000 */
se=d7+0.40*(sr-80000);
else /* 超过部分>=100000 */
se=d8+0.45*(sr-100000);
printf("%.2f, %.2f\n",sr+2000,se);
return 0;
}